In [1]:
import pandas as pd

print(pd)

<module 'pandas' from '/Users/suren/MyFiles/OTUS/lessons/Python-Basic.2022-02/35.pandas/venv/lib/python3.10/site-packages/pandas/__init__.py'>

In [2]:
salries_list = [
    165.5,
    234.8,
    211.1,
    455.3,
    152.9,
    532.7,
]

salries_list

[165.5, 234.8, 211.1, 455.3, 152.9, 532.7]

In [3]:
salaries_series = pd.Series(salries_list)
salaries_series

0    165.5
1    234.8
2    211.1
3    455.3
4    152.9
5    532.7
dtype: float64

In [4]:
print(salaries_series)

0    165.5
1    234.8
2    211.1
3    455.3
4    152.9
5    532.7
dtype: float64

In [5]:
print(type(salaries_series))

<class 'pandas.core.series.Series'>

In [6]:
salaries_series.to_list()

[165.5, 234.8, 211.1, 455.3, 152.9, 532.7]

In [7]:
salaries_series.to_numpy()

array([165.5, 234.8, 211.1, 455.3, 152.9, 532.7])

In [8]:
salaries_series.to_numpy().dtype

dtype('float64')

In [9]:
workers_names = [
    "John",
    "Kate",
    "Sam",
    "Nick",
    "Clark",
    "Ann",
]
workers_names

['John', 'Kate', 'Sam', 'Nick', 'Clark', 'Ann']

In [10]:
salaries = pd.Series(
    salries_list,
    index=workers_names,
    name="Salaries",
)

salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [11]:
salaries['John']

165.5

In [12]:
salaries[2]

211.1

In [13]:
salaries.index

Index(['John', 'Kate', 'Sam', 'Nick', 'Clark', 'Ann'], dtype='object')

In [14]:
salaries_series.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
salaries_series[3:5]

3    455.3
4    152.9
dtype: float64

In [16]:
salaries_series

0    165.5
1    234.8
2    211.1
3    455.3
4    152.9
5    532.7
dtype: float64

In [17]:
salaries[2:4]

Sam     211.1
Nick    455.3
Name: Salaries, dtype: float64

In [18]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [19]:
salaries['Kate':'Clark']

Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Name: Salaries, dtype: float64

In [20]:
salaries[0:4]

John    165.5
Kate    234.8
Sam     211.1
Nick    455.3
Name: Salaries, dtype: float64

In [21]:
salaries[:4]

John    165.5
Kate    234.8
Sam     211.1
Nick    455.3
Name: Salaries, dtype: float64

In [22]:
salaries[:'Nick']

John    165.5
Kate    234.8
Sam     211.1
Nick    455.3
Name: Salaries, dtype: float64

In [23]:
print(salaries)

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [24]:
dir(salaries)

['Ann',
 'Clark',
 'John',
 'Kate',
 'Nick',
 'Sam',
 'T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__long__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_binop',
 '_can_hold_na',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_convert',
 '_convert_dtypes',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_duplicated',
 '_find_valid_index',
 '_flags',
 '_from_mgr',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_index_resolvers',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values',
 '_get_values_tuple',
 '_get_with',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_item_cache',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_map_values',
 '_maybe_update_cacher',
 '_memory_usage',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_name',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_single',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_labels',
 '_set_name',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'set_flags',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [25]:
salaries.mean()

292.05

In [26]:
help(salaries.mean)

Help on method mean in module pandas.core.generic:

mean(axis: 'int | None | lib.NoDefault' = <no_default>, skipna=True, level=None, numeric_only=None, **kwargs) method of pandas.core.series.Series instance
    Return the mean of the values over the requested axis.

    Parameters
    ----------
    axis : {index (0)}
        Axis for the function to be applied on.
    skipna : bool, default True
        Exclude NA/null values when computing the result.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a scalar.
    numeric_only : bool, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.
    **kwargs
        Additional keyword arguments to be passed to the function.

    Returns
    -------
    scalar or Series (if level specified)

In [27]:
salaries.mean()

292.05

In [28]:
salaries.median()

222.95

In [29]:
salaries.value_counts()

165.5    1
234.8    1
211.1    1
455.3    1
152.9    1
532.7    1
Name: Salaries, dtype: int64

In [30]:
pd.Series([1, 2, 3, 2, 3, 1, 4, 5, 2]).value_counts()

2    3
1    2
3    2
4    1
5    1
dtype: int64

In [31]:
pd.Series([1, 2, 3, 2, 3, 1, 4, 5, 2]).value_counts(normalize=True)

2    0.333333
1    0.222222
3    0.222222
4    0.111111
5    0.111111
dtype: float64

In [32]:
s = salaries.copy()

In [33]:
s

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [34]:
s == salaries

John     True
Kate     True
Sam      True
Nick     True
Clark    True
Ann      True
Name: Salaries, dtype: bool

In [35]:
s is salaries

False

In [36]:
s.index

Index(['John', 'Kate', 'Sam', 'Nick', 'Clark', 'Ann'], dtype='object')

In [37]:
s.reset_index

<bound method Series.reset_index of John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64>

In [38]:
s.reset_index()

   index  Salaries
0   John     165.5
1   Kate     234.8
2    Sam     211.1
3   Nick     455.3
4  Clark     152.9
5    Ann     532.7

In [39]:
print(s.reset_index())

   index  Salaries
0   John     165.5
1   Kate     234.8
2    Sam     211.1
3   Nick     455.3
4  Clark     152.9
5    Ann     532.7

In [40]:
s

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [41]:
s.reset_index(inplace=True, drop=True)

In [42]:
s

0    165.5
1    234.8
2    211.1
3    455.3
4    152.9
5    532.7
Name: Salaries, dtype: float64

In [43]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [44]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [45]:
salaries.reset_index(drop=True)

0    165.5
1    234.8
2    211.1
3    455.3
4    152.9
5    532.7
Name: Salaries, dtype: float64

In [46]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [47]:
salaries.describe()

count      6.000000
mean     292.050000
std      161.103119
min      152.900000
25%      176.900000
50%      222.950000
75%      400.175000
max      532.700000
Name: Salaries, dtype: float64

In [48]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [49]:
salaries.to_json()

'{"John":165.5,"Kate":234.8,"Sam":211.1,"Nick":455.3,"Clark":152.9,"Ann":532.7}'

In [50]:
workers_salaries = [
    {
        "name": "John",
        "salary": 169.5,
        "age": 18,
    },
    {
        "name": "Sam",
        "salary": 234.7,
        "age": 27,
    },
    
    {
        "name": "Bob",
        "salary": 158.3,
        "age": 33,
    },
]

salaries_df = pd.DataFrame(workers_salaries)
salaries_df

   name  salary  age
0  John   169.5   18
1   Sam   234.7   27
2   Bob   158.3   33

In [51]:
salaries_df.index

RangeIndex(start=0, stop=3, step=1)

In [52]:
salaries_df['name']

0    John
1     Sam
2     Bob
Name: name, dtype: object

In [53]:
salaries_df['name'][0]

'John'

In [54]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [55]:
help(salaries.iloc)

Help on _iLocIndexer in module pandas.core.indexing object:

class _iLocIndexer(_LocationIndexer)
 |  Purely integer-location based indexing for selection by position.
 |
 |  ``.iloc[]`` is primarily integer position based (from ``0`` to
 |  ``length-1`` of the axis), but may also be used with a boolean
 |  array.
 |
 |  Allowed inputs are:
 |
 |  - An integer, e.g. ``5``.
 |  - A list or array of integers, e.g. ``[4, 3, 0]``.
 |  - A slice object with ints, e.g. ``1:7``.
 |  - A boolean array.
 |  - A ``callable`` function with one argument (the calling Series or
 |    DataFrame) and that returns valid output for indexing (one of the above).
 |    This is useful in method chains, when you don't have a reference to the
 |    calling object, but would like to base your selection on some value.
 |
 |  ``.iloc`` will raise ``IndexError`` if a requested indexer is
 |  out-of-bounds, except *slice* indexers which allow out-of-bounds
 |  indexing (this conforms with python/numpy *slice* semantics).
 |
 |  See more at :ref:`Selection by Position <indexing.integer>`.
 |
 |  See Also
 |  --------
 |  DataFrame.iat : Fast integer location scalar accessor.
 |  DataFrame.loc : Purely label-location based indexer for selection by label.
 |  Series.iloc : Purely integer-location based indexing for
 |                 selection by position.
 |
 |  Examples
 |  --------
 |  >>> mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 |  ...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 |  ...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
 |  >>> df = pd.DataFrame(mydict)
 |  >>> df
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  **Indexing just the rows**
 |
 |  With a scalar integer.
 |
 |  >>> type(df.iloc[0])
 |  <class 'pandas.core.series.Series'>
 |  >>> df.iloc[0]
 |  a    1
 |  b    2
 |  c    3
 |  d    4
 |  Name: 0, dtype: int64
 |
 |  With a list of integers.
 |
 |  >>> df.iloc[[0]]
 |     a  b  c  d
 |  0  1  2  3  4
 |  >>> type(df.iloc[[0]])
 |  <class 'pandas.core.frame.DataFrame'>
 |
 |  >>> df.iloc[[0, 1]]
 |       a    b    c    d
 |  0    1    2    3    4
 |  1  100  200  300  400
 |
 |  With a `slice` object.
 |
 |  >>> df.iloc[:3]
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  With a boolean mask the same length as the index.
 |
 |  >>> df.iloc[[True, False, True]]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  With a callable, useful in method chains. The `x` passed
 |  to the ``lambda`` is the DataFrame being sliced. This selects
 |  the rows whose index label even.
 |
 |  >>> df.iloc[lambda x: x.index % 2 == 0]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  **Indexing both axes**
 |
 |  You can mix the indexer types for the index and columns. Use ``:`` to
 |  select the entire axis.
 |
 |  With scalar integers.
 |
 |  >>> df.iloc[0, 1]
 |  2
 |
 |  With lists of integers.
 |
 |  >>> df.iloc[[0, 2], [1, 3]]
 |        b     d
 |  0     2     4
 |  2  2000  4000
 |
 |  With `slice` objects.
 |
 |  >>> df.iloc[1:3, 0:3]
 |        a     b     c
 |  1   100   200   300
 |  2  1000  2000  3000
 |
 |  With a boolean array whose length matches the columns.
 |
 |  >>> df.iloc[:, [True, False, True, False]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  With a callable function that expects the Series or DataFrame.
 |
 |  >>> df.iloc[:, lambda df: [0, 2]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  Method resolution order:
 |      _iLocIndexer
 |      _LocationIndexer
 |      pandas._libs.indexing.NDFrameIndexerBase
 |      builtins.object
 |
 |  Data and other attributes defined here:
 |
 |  __annotations__ = {}
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _LocationIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __getitem__(self, key)
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _LocationIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _LocationIndexer:
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

In [56]:
help(salaries.loc)

Help on _LocIndexer in module pandas.core.indexing object:

class _LocIndexer(_LocationIndexer)
 |  Access a group of rows and columns by label(s) or a boolean array.
 |
 |  ``.loc[]`` is primarily label based, but may also be used with a
 |  boolean array.
 |
 |  Allowed inputs are:
 |
 |  - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
 |    interpreted as a *label* of the index, and **never** as an
 |    integer position along the index).
 |  - A list or array of labels, e.g. ``['a', 'b', 'c']``.
 |  - A slice object with labels, e.g. ``'a':'f'``.
 |
 |    .. warning:: Note that contrary to usual python slices, **both** the
 |        start and the stop are included
 |
 |  - A boolean array of the same length as the axis being sliced,
 |    e.g. ``[True, False, True]``.
 |  - An alignable boolean Series. The index of the key will be aligned before
 |    masking.
 |  - An alignable Index. The Index of the returned selection will be the input.
 |  - A ``callable`` function with one argument (the calling Series or
 |    DataFrame) and that returns valid output for indexing (one of the above)
 |
 |  See more at :ref:`Selection by Label <indexing.label>`.
 |
 |  Raises
 |  ------
 |  KeyError
 |      If any items are not found.
 |  IndexingError
 |      If an indexed key is passed and its index is unalignable to the frame index.
 |
 |  See Also
 |  --------
 |  DataFrame.at : Access a single value for a row/column label pair.
 |  DataFrame.iloc : Access group of rows and columns by integer position(s).
 |  DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
 |      Series/DataFrame.
 |  Series.loc : Access group of values using labels.
 |
 |  Examples
 |  --------
 |  **Getting values**
 |
 |  >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 |  ...      index=['cobra', 'viper', 'sidewinder'],
 |  ...      columns=['max_speed', 'shield'])
 |  >>> df
 |              max_speed  shield
 |  cobra               1       2
 |  viper               4       5
 |  sidewinder          7       8
 |
 |  Single label. Note this returns the row as a Series.
 |
 |  >>> df.loc['viper']
 |  max_speed    4
 |  shield       5
 |  Name: viper, dtype: int64
 |
 |  List of labels. Note using ``[[]]`` returns a DataFrame.
 |
 |  >>> df.loc[['viper', 'sidewinder']]
 |              max_speed  shield
 |  viper               4       5
 |  sidewinder          7       8
 |
 |  Single label for row and column
 |
 |  >>> df.loc['cobra', 'shield']
 |  2
 |
 |  Slice with labels for row and single label for column. As mentioned
 |  above, note that both the start and stop of the slice are included.
 |
 |  >>> df.loc['cobra':'viper', 'max_speed']
 |  cobra    1
 |  viper    4
 |  Name: max_speed, dtype: int64
 |
 |  Boolean list with the same length as the row axis
 |
 |  >>> df.loc[[False, False, True]]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  Alignable boolean Series:
 |
 |  >>> df.loc[pd.Series([False, True, False],
 |  ...        index=['viper', 'sidewinder', 'cobra'])]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  Index (same behavior as ``df.reindex``)
 |
 |  >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
 |         max_speed  shield
 |  foo
 |  cobra          1       2
 |  viper          4       5
 |
 |  Conditional that returns a boolean Series
 |
 |  >>> df.loc[df['shield'] > 6]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  Conditional that returns a boolean Series with column labels specified
 |
 |  >>> df.loc[df['shield'] > 6, ['max_speed']]
 |              max_speed
 |  sidewinder          7
 |
 |  Callable that returns a boolean Series
 |
 |  >>> df.loc[lambda df: df['shield'] == 8]
 |              max_speed  shield
 |  sidewinder          7       8
 |
 |  **Setting values**
 |
 |  Set value for all items matching the list of labels
 |
 |  >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
 |  >>> df
 |              max_speed  shield
 |  cobra               1       2
 |  viper               4      50
 |  sidewinder          7      50
 |
 |  Set value for an entire row
 |
 |  >>> df.loc['cobra'] = 10
 |  >>> df
 |              max_speed  shield
 |  cobra              10      10
 |  viper               4      50
 |  sidewinder          7      50
 |
 |  Set value for an entire column
 |
 |  >>> df.loc[:, 'max_speed'] = 30
 |  >>> df
 |              max_speed  shield
 |  cobra              30      10
 |  viper              30      50
 |  sidewinder         30      50
 |
 |  Set value for rows matching callable condition
 |
 |  >>> df.loc[df['shield'] > 35] = 0
 |  >>> df
 |              max_speed  shield
 |  cobra              30      10
 |  viper               0       0
 |  sidewinder          0       0
 |
 |  **Getting values on a DataFrame with an index that has integer labels**
 |
 |  Another example using integers for the index
 |
 |  >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
 |  ...      index=[7, 8, 9], columns=['max_speed', 'shield'])
 |  >>> df
 |     max_speed  shield
 |  7          1       2
 |  8          4       5
 |  9          7       8
 |
 |  Slice with integer labels for rows. As mentioned above, note that both
 |  the start and stop of the slice are included.
 |
 |  >>> df.loc[7:9]
 |     max_speed  shield
 |  7          1       2
 |  8          4       5
 |  9          7       8
 |
 |  **Getting values with a MultiIndex**
 |
 |  A number of examples using a DataFrame with a MultiIndex
 |
 |  >>> tuples = [
 |  ...    ('cobra', 'mark i'), ('cobra', 'mark ii'),
 |  ...    ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
 |  ...    ('viper', 'mark ii'), ('viper', 'mark iii')
 |  ... ]
 |  >>> index = pd.MultiIndex.from_tuples(tuples)
 |  >>> values = [[12, 2], [0, 4], [10, 20],
 |  ...         [1, 4], [7, 1], [16, 36]]
 |  >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
 |  >>> df
 |                       max_speed  shield
 |  cobra      mark i           12       2
 |             mark ii           0       4
 |  sidewinder mark i           10      20
 |             mark ii           1       4
 |  viper      mark ii           7       1
 |             mark iii         16      36
 |
 |  Single label. Note this returns a DataFrame with a single index.
 |
 |  >>> df.loc['cobra']
 |           max_speed  shield
 |  mark i          12       2
 |  mark ii          0       4
 |
 |  Single index tuple. Note this returns a Series.
 |
 |  >>> df.loc[('cobra', 'mark ii')]
 |  max_speed    0
 |  shield       4
 |  Name: (cobra, mark ii), dtype: int64
 |
 |  Single label for row and column. Similar to passing in a tuple, this
 |  returns a Series.
 |
 |  >>> df.loc['cobra', 'mark i']
 |  max_speed    12
 |  shield        2
 |  Name: (cobra, mark i), dtype: int64
 |
 |  Single tuple. Note using ``[[]]`` returns a DataFrame.
 |
 |  >>> df.loc[[('cobra', 'mark ii')]]
 |                 max_speed  shield
 |  cobra mark ii          0       4
 |
 |  Single tuple for the index with a single label for the column
 |
 |  >>> df.loc[('cobra', 'mark i'), 'shield']
 |  2
 |
 |  Slice from index tuple to single label
 |
 |  >>> df.loc[('cobra', 'mark i'):'viper']
 |                       max_speed  shield
 |  cobra      mark i           12       2
 |             mark ii           0       4
 |  sidewinder mark i           10      20
 |             mark ii           1       4
 |  viper      mark ii           7       1
 |             mark iii         16      36
 |
 |  Slice from index tuple to index tuple
 |
 |  >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
 |                      max_speed  shield
 |  cobra      mark i          12       2
 |             mark ii          0       4
 |  sidewinder mark i          10      20
 |             mark ii          1       4
 |  viper      mark ii          7       1
 |
 |  Method resolution order:
 |      _LocIndexer
 |      _LocationIndexer
 |      pandas._libs.indexing.NDFrameIndexerBase
 |      builtins.object
 |
 |  Data and other attributes defined here:
 |
 |  __annotations__ = {'_takeable': 'bool'}
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _LocationIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __getitem__(self, key)
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _LocationIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _LocationIndexer:
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing.NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

In [57]:
salaries

John     165.5
Kate     234.8
Sam      211.1
Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [58]:
salaries['Nick']

455.3

In [59]:
salaries['Nick':'Ann']

Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [60]:
salaries.loc['Nick':'Ann']

Nick     455.3
Clark    152.9
Ann      532.7
Name: Salaries, dtype: float64

In [61]:
salaries.iloc[3:5]

Nick     455.3
Clark    152.9
Name: Salaries, dtype: float64

In [62]:
salaries[3:5]

Nick     455.3
Clark    152.9
Name: Salaries, dtype: float64

In [63]:
salaries_df

   name  salary  age
0  John   169.5   18
1   Sam   234.7   27
2   Bob   158.3   33

In [64]:
salaries_df.iloc[1]

name        Sam
salary    234.7
age          27
Name: 1, dtype: object

In [65]:
salaries_df.iloc[1:2]

  name  salary  age
1  Sam   234.7   27

In [66]:
salaries_df.iloc[0:2]

   name  salary  age
0  John   169.5   18
1   Sam   234.7   27

In [67]:
salaries_df.iloc[1:3]

  name  salary  age
1  Sam   234.7   27
2  Bob   158.3   33

In [68]:
salaries_df.loc[0]

name       John
salary    169.5
age          18
Name: 0, dtype: object

In [69]:
salaries_df.index

RangeIndex(start=0, stop=3, step=1)

In [70]:
salaries_df.index = ['j', 's', 'b']

In [71]:
salaries_df

   name  salary  age
j  John   169.5   18
s   Sam   234.7   27
b   Bob   158.3   33

In [72]:
salaries_df.loc['j']

name       John
salary    169.5
age          18
Name: j, dtype: object

In [73]:
salaries_df.loc['j':'s']

   name  salary  age
j  John   169.5   18
s   Sam   234.7   27

In [74]:
salaries_df.iloc[1]

name        Sam
salary    234.7
age          27
Name: s, dtype: object

In [75]:
salaries_df.iloc[1:3]

  name  salary  age
s  Sam   234.7   27
b  Bob   158.3   33

In [76]:
salaries_df.to_json()

'{"name":{"j":"John","s":"Sam","b":"Bob"},"salary":{"j":169.5,"s":234.7,"b":158.3},"age":{"j":18,"s":27,"b":33}}'

In [77]:
salaries_df.to_csv('salaries.csv')

In [78]:
pd.read_csv('salaries.csv')

  Unnamed: 0  name  salary  age
0          j  John   169.5   18
1          s   Sam   234.7   27
2          b   Bob   158.3   33

In [79]:
pd.read_csv('salaries.csv', index_col=0)

   name  salary  age
j  John   169.5   18
s   Sam   234.7   27
b   Bob   158.3   33

In [80]:
salaries_df

   name  salary  age
j  John   169.5   18
s   Sam   234.7   27
b   Bob   158.3   33

In [81]:
salaries_df.to_dict()

{'name': {'j': 'John', 's': 'Sam', 'b': 'Bob'},
 'salary': {'j': 169.5, 's': 234.7, 'b': 158.3},
 'age': {'j': 18, 's': 27, 'b': 33}}

In [82]:
salaries_df.iterrows()

In [83]:
for item in salaries_df.iterrows():
    print(item)

('j', name       John
salary    169.5
age          18
Name: j, dtype: object)
('s', name        Sam
salary    234.7
age          27
Name: s, dtype: object)
('b', name        Bob
salary    158.3
age          33
Name: b, dtype: object)

In [84]:
for idx, row in salaries_df.iterrows():
    print(idx, row.age, row['name'])
    print(type(row))

j 18 John
<class 'pandas.core.series.Series'>
s 27 Sam
<class 'pandas.core.series.Series'>
b 33 Bob
<class 'pandas.core.series.Series'>

In [85]:
salaries_df.iloc[1:3]

  name  salary  age
s  Sam   234.7   27
b  Bob   158.3   33

In [86]:
salaries_df.loc['s':'b']

  name  salary  age
s  Sam   234.7   27
b  Bob   158.3   33

In [87]:
salaries_df.loc['s':'b', 'salary']

s    234.7
b    158.3
Name: salary, dtype: float64

In [88]:
salaries_df.loc['s':'b', ['name', 'salary']]

  name  salary
s  Sam   234.7
b  Bob   158.3

In [89]:
countries_info = {
    'country': ['Russia', 'Kazakhstan', 'Ukraine', 'Belarus'],
    'population': [144.5, 18.3, 42.4, 9.5],
    'square': [17_250_000, 2_724_900, 603_628, 207_595],
}
countries_indexes = ['RU', 'KZ', 'UA', 'BY']

countries_df = pd.DataFrame(
    countries_info,
    index=countries_indexes,
)
countries_df

       country  population    square
RU      Russia       144.5  17250000
KZ  Kazakhstan        18.3   2724900
UA     Ukraine        42.4    603628
BY     Belarus         9.5    207595

In [90]:
countries_df.index

Index(['RU', 'KZ', 'UA', 'BY'], dtype='object')

In [91]:
countries_df.index.name = 'code'

In [92]:
countries_df.index

Index(['RU', 'KZ', 'UA', 'BY'], dtype='object', name='code')

In [93]:
countries_df

         country  population    square
code
RU        Russia       144.5  17250000
KZ    Kazakhstan        18.3   2724900
UA       Ukraine        42.4    603628
BY       Belarus         9.5    207595

In [94]:
countries_df['density'] = countries_df.population * 1_000_000 / countries_df.square
countries_df

         country  population    square    density
code
RU        Russia       144.5  17250000   8.376812
KZ    Kazakhstan        18.3   2724900   6.715843
UA       Ukraine        42.4    603628  70.241937
BY       Belarus         9.5    207595  45.762181

In [95]:
round(2.5)

2

In [96]:
round(2.6)

3

In [97]:
countries_df['density_int'] = countries_df['density'].apply(round)
countries_df

         country  population    square    density  density_int
code
RU        Russia       144.5  17250000   8.376812            8
KZ    Kazakhstan        18.3   2724900   6.715843            7
UA       Ukraine        42.4    603628  70.241937           70
BY       Belarus         9.5    207595  45.762181           46

In [98]:
countries_df.drop('density', axis=1)

         country  population    square  density_int
code
RU        Russia       144.5  17250000            8
KZ    Kazakhstan        18.3   2724900            7
UA       Ukraine        42.4    603628           70
BY       Belarus         9.5    207595           46

In [99]:
countries_df

         country  population    square    density  density_int
code
RU        Russia       144.5  17250000   8.376812            8
KZ    Kazakhstan        18.3   2724900   6.715843            7
UA       Ukraine        42.4    603628  70.241937           70
BY       Belarus         9.5    207595  45.762181           46

In [100]:
# countries_df.drop(inplace=True)
countries_df.drop(columns=['density'])

         country  population    square  density_int
code
RU        Russia       144.5  17250000            8
KZ    Kazakhstan        18.3   2724900            7
UA       Ukraine        42.4    603628           70
BY       Belarus         9.5    207595           46

In [101]:
titanic_df = pd.read_csv('data/titanic.csv')
titanic_df

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...,...
1308,1309,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.00,male,0,0

In [102]:
# pd.set_option('display.max_columns', 10)
# pd.set_option('display.max_rows', 10)

In [103]:
titanic_df.tail(10)

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
1303,1304,"Yasbeck, Mr Antoni",3rd,27.0,male,0,0
1304,1305,"Yasbeck, Mrs Antoni",3rd,15.0,female,1,1
1305,1306,"Youssef, Mr Gerios",3rd,NaN,male,0,0
1306,1307,"Zabour, Miss Hileni",3rd,NaN,female,0,1
1307,1308,"Zabour, Miss Tamini",3rd,NaN,female,0,1
1308,1309,"Zakarian, Mr Artun",3rd,27.0,male,0,0
1309,1310,"Zakarian, Mr Maprieder",3rd,26.0,male,0,0
1310,1311,"Zenni, Mr Philip",3rd,22.0,male,0,0
1311,1312,"Lievens, Mr Rene",3rd,24.0,male,0,0
1312,1313,"Zimmerman, Leo",3rd,29.0,male,0,0

In [104]:
titanic_df.head(10)

,PassengerID,Name,PClass,Age,Sex,Survived,SexCode
0,1,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,2,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,3,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,4,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,5,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,6,"Anderson, Mr Harry",1st,47.00,male,1,0
6,7,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
7,8,"Andrews, Mr Thomas, jr",1st,39.00,male,0,0
8,9,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
9,10,"Artagaveytia, Mr Ramon",1st,71.00,male,0,0

In [105]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerID  1313 non-null   int64
 1   Name         1313 non-null   object
 2   PClass       1313 non-null   object
 3   Age          756 non-null    float64
 4   Sex          1313 non-null   object
 5   Survived     1313 non-null   int64
 6   SexCode      1313 non-null   int64
dtypes: float64(1), int64(3), object(3)
memory usage: 71.9+ KB

In [106]:
titanic_df.describe()

       PassengerID         Age     Survived      SexCode
count  1313.000000  756.000000  1313.000000  1313.000000
mean    657.000000   30.397989     0.342727     0.351866
std     379.174762   14.259049     0.474802     0.477734
min       1.000000    0.170000     0.000000     0.000000
25%     329.000000   21.000000     0.000000     0.000000
50%     657.000000   28.000000     0.000000     0.000000
75%     985.000000   39.000000     1.000000     1.000000
max    1313.000000   71.000000     1.000000     1.000000

In [107]:
titanic_df.columns

Index(['PassengerID', 'Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

In [108]:
df = titanic_df

In [109]:
df['PClass']

0       1st
1       1st
2       1st
3       1st
4       1st
       ...
1308    3rd
1309    3rd
1310    3rd
1311    3rd
1312    3rd
Name: PClass, Length: 1313, dtype: object

In [110]:
df['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [111]:
df.value_counts('PClass', normalize=True)

PClass
3rd    0.541508
1st    0.245240
2nd    0.212490
*      0.000762
dtype: float64

In [112]:
df['PClass'] is not None

True

In [113]:
df['PClass'] != None

0       True
1       True
2       True
3       True
4       True
        ...
1308    True
1309    True
1310    True
1311    True
1312    True
Name: PClass, Length: 1313, dtype: bool

In [114]:
df['PClass'] == None

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Name: PClass, Length: 1313, dtype: bool

In [115]:
df.loc[df['PClass'] == '*']

     PassengerID                 Name PClass  Age   Sex  Survived  SexCode
456          457  Jacobsohn Mr Samuel      *  NaN  male         0        0

In [116]:
df.value_counts('Sex')

Sex
male      851
female    462
dtype: int64

In [117]:
df.value_counts('Age')

Age
22.00    35
30.00    31
21.00    31
18.00    30
36.00    29
         ..
0.80      1
67.00     1
69.00     1
70.00     1
0.17      1
Length: 75, dtype: int64

In [118]:
print(df.groupby('Sex'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x126421780>

In [119]:
df.groupby('Sex').count()

        PassengerID  Name  PClass  Age  Survived  SexCode
Sex
female          462   462     462  288       462      462
male            851   851     851  468       851      851

In [120]:
df.groupby('Sex').mean()

        PassengerID        Age  Survived  SexCode
Sex
female   592.679654  29.396424  0.666667      1.0
male     691.918919  31.014338  0.166863      0.0

In [121]:
df.groupby('Sex').median()

        PassengerID   Age  Survived  SexCode
Sex
female        563.5  27.0       1.0      1.0
male          715.0  29.0       0.0      0.0

In [122]:
df.groupby('Sex')['Age'].median()

Sex
female    27.0
male      29.0
Name: Age, dtype: float64

In [123]:
df.groupby(['Sex', 'Survived']).count()

                 PassengerID  Name  PClass  Age  SexCode
Sex    Survived
female 0                 154   154     154   71      154
       1                 308   308     308  217      308
male   0                 709   709     709  372      709
       1                 142   142     142   96      142

In [124]:
df.groupby(['Sex', 'Survived'])[['PassengerID']].count()

                 PassengerID
Sex    Survived
female 0                 154
       1                 308
male   0                 709
       1                 142

In [125]:
df.groupby(['Sex', 'Survived'])[['Age']].median()

                  Age
Sex    Survived
female 0         24.0
       1         29.0
male   0         29.0
       1         26.0

In [126]:
df.pivot_table(
    index=['Sex'],
    columns=['PClass'],
    values=['Age'],
    aggfunc='mean',
)

              Age
PClass        1st        2nd        3rd
Sex
female  37.772277  27.388235  22.776176
male    41.199360  28.910472  26.357222

In [127]:
df.pivot_table(
    index=['Sex'],
    columns=['PClass'],
    values=['Age'],
    aggfunc='median',
)

         Age
PClass   1st   2nd   3rd
Sex
female  38.0  28.0  22.0
male    42.0  28.0  25.5

In [128]:
df.pivot_table(
    index=['Sex'],
    columns=['Survived'],
    values=['Age'],
    aggfunc='mean',
)

                Age
Survived          0          1
Sex
female    24.901408  30.867143
male      32.320780  25.951875

In [129]:
df.pivot_table(
    index=['Sex'],
    columns=['Survived'],
    values=['Age'],
    aggfunc='median',
)

           Age
Survived     0     1
Sex
female    24.0  29.0
male      29.0  26.0

In [130]:
weights_df = pd.read_csv('data/weights.csv', index_col=0, parse_dates=True)
weights_df

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2014-01-14,0.184660,0.275706,0.303425,0.042841,0.193368
2014-01-15,0.225875,0.147861,0.151211,0.224074,0.250978
2014-01-16,0.261017,0.334213,0.293336,0.015744,0.095690
2014-01-17,0.160168,0.231034,0.092674,0.269050,0.247074
2014-01-18,0.057162,0.254146,0.027286,0.480660,0.180746
...,...,...,...,...,...
2018-02-28,0.123821,0.167899,0.120844,0.088780,0.498657
2018-03-01,0.035043,0.289624,0.220871,0.136366,0.318096
2018-03-02,0.397155,0.362025,0.050554,0.020247,0.170019
2018-03-03,0.319902,0.277405,0.051719,0.008164,0.342810
2018-03-06,0.057699,0.352290,0.291162,0.197700,0.101148

In [131]:
weights_df.sort_index(ascending=False)

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2018-03-06,0.057699,0.352290,0.291162,0.197700,0.101148
2018-03-03,0.319902,0.277405,0.051719,0.008164,0.342810
2018-03-02,0.397155,0.362025,0.050554,0.020247,0.170019
2018-03-01,0.035043,0.289624,0.220871,0.136366,0.318096
2018-02-28,0.123821,0.167899,0.120844,0.088780,0.498657
...,...,...,...,...,...
2014-01-18,0.057162,0.254146,0.027286,0.480660,0.180746
2014-01-17,0.160168,0.231034,0.092674,0.269050,0.247074
2014-01-16,0.261017,0.334213,0.293336,0.015744,0.095690
2014-01-15,0.225875,0.147861,0.151211,0.224074,0.250978
2014-01-14,0.184660,0.275706,0.303425,0.042841,0.193368

In [132]:
df = weights_df

In [133]:
df.index

DatetimeIndex(['2014-01-14', '2014-01-15', '2014-01-16', '2014-01-17',
               '2014-01-18', '2014-01-21', '2014-01-22', '2014-01-23',
               '2014-01-24', '2014-01-25',
               ...
               '2018-02-21', '2018-02-22', '2018-02-23', '2018-02-24',
               '2018-02-27', '2018-02-28', '2018-03-01', '2018-03-02',
               '2018-03-03', '2018-03-06'],
              dtype='datetime64[ns]', length=1081, freq=None)

In [134]:
df.columns

Index(['AT0000A18XM4 SW', 'BE0974268972 BB', 'US0527691069 US',
       'DE0007164600 GR', 'US6092071058 US'],
      dtype='object')

In [135]:
df['US0527691069 US']

2014-01-14    0.303425
2014-01-15    0.151211
2014-01-16    0.293336
2014-01-17    0.092674
2014-01-18    0.027286
                ...
2018-02-28    0.120844
2018-03-01    0.220871
2018-03-02    0.050554
2018-03-03    0.051719
2018-03-06    0.291162
Name: US0527691069 US, Length: 1081, dtype: float64

In [136]:
df['US0527691069 US'].head()

2014-01-14    0.303425
2014-01-15    0.151211
2014-01-16    0.293336
2014-01-17    0.092674
2014-01-18    0.027286
Name: US0527691069 US, dtype: float64

In [137]:
df.agg(['min', 'max', 'mean', 'median'])

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
min,0.000063,0.000018,0.000331,2.895741e-07,0.000132
max,0.588783,0.638583,0.792982,8.555499e-01,0.621904
mean,0.192054,0.203109,0.204913,2.009432e-01,0.198981
median,0.188876,0.201496,0.200618,1.987364e-01,0.204044

In [138]:
df.idxmax()

AT0000A18XM4 SW   2017-05-06
BE0974268972 BB   2014-10-08
US0527691069 US   2017-08-24
DE0007164600 GR   2017-01-25
US6092071058 US   2016-06-15
dtype: datetime64[ns]

In [139]:
df.idxmin()

AT0000A18XM4 SW   2015-03-14
BE0974268972 BB   2015-07-04
US0527691069 US   2016-04-20
DE0007164600 GR   2018-01-23
US6092071058 US   2015-08-21
dtype: datetime64[ns]

In [140]:
df.loc[df.idxmin()]

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2015-03-14,0.000063,0.426246,0.013127,3.071502e-01,0.253414
2015-07-04,0.041093,0.000018,0.390096,2.017649e-01,0.367028
2016-04-20,0.178660,0.372705,0.000331,4.105506e-01,0.037754
2018-01-23,0.114776,0.064787,0.622151,2.895741e-07,0.198286
2015-08-21,0.101986,0.206050,0.344479,3.473532e-01,0.000132

In [141]:
df.loc[df.idxmax()]

,AT0000A18XM4 SW,BE0974268972 BB,US0527691069 US,DE0007164600 GR,US6092071058 US
2017-05-06,0.588783,0.098971,0.065059,0.220716,0.026471
2014-10-08,0.055022,0.638583,0.087784,0.004366,0.214245
2017-08-24,0.016481,0.081014,0.792982,0.034498,0.075025
2017-01-25,0.033026,0.044487,0.063948,0.855550,0.002989
2016-06-15,0.089216,0.227885,0.007397,0.053598,0.621904

In [142]:
import json

In [143]:
with open('data/fines.json', 'r') as f:
    fines_data = json.load(f)

fines_data.keys()

dict_keys(['Message', 'ShowMessage', 'StateCode', 'TimeStamp', 'Value'])

In [144]:
fines_values = json.loads(fines_data['Value'])['Fines']
len(fines_values)

835

In [145]:
type('fines_values')

str

In [146]:
type(fines_values)

list

In [147]:
print(fines_values[0])

{'AdminOffensesTypeText': 'Штраф', 'AmountToPay': 0, 'ApnDetail': [{'AttrId': 'StAP', 'Name': 'Статья КоАП или закона субъекта РФ, состав правонарушения', 'Value': '12.17 ч.1.2 - Движение или остановка на полосе для маршрутных ТС в Москве или в Санкт-Петербурге'}, {'AttrId': 'MestoDAP', 'Name': 'Место составления документа', 'Value': 'САДОВАЯ-САМОТЕЧНАЯ,д.1,ТВЕРСКОЙ (ЦАО) Р-Н'}, {'AttrId': 'DatNar', 'Name': 'Дата и время нарушения', 'Value': '23.01.2018 00:21:00'}, {'AttrId': 'MestoNar', 'Name': 'Место нарушения', 'Value': 'МОСКВА Г.   МОХОВАЯ д.15/1'}, {'AttrId': 'OdpsName', 'Name': 'Орган власти, выявивший нарушение', 'Value': 'ЦАФАП ОДД ГИБДД ГУ МВД России по г.Москве'}, {'AttrId': 'FIONarush', 'Name': 'Нарушитель', 'Value': 'ЛЕОНИД ЭДУАРДОВИЧ'}, {'AttrId': 'GRZNarush', 'Name': 'Транспортное средство', 'Value': 'С700*****'}], 'DAP': '18810177180125209293', 'DAPName': 'Постановление по видеофиксации №18810177180125209293 от 25.01.2018', 'DateDAP': '25.01.2018', 'DiscountDate': '', 'DiscountSize': '', 'DiscountSizeAmountToPaySum': None, 'FineStatus': 1, 'FineSum': 3000, 'HasAdditionalActions': False, 'HasPhoto': True, 'IsFine': True, 'Latitude': '55,7563209999', 'Longitude': '37,614136', 'OdpsKod': '1145519', 'PayedAmountSum': None, 'PaymentId': '', 'Sh': '{"DAP":"18810177180125209293","DateDAP":"25.01.2018","ODPS":"ЦАФАП ОДД ГИБДД ГУ МВД России по г.Москве","PaymentID":null,"RsRschet":"40101810045250010041","SgBuk":"044525000","ShBankName":"ГУ Банка России по ЦФО","ShInn":"7707089101","ShKbk":"18811630020016000140","ShKpp":"770731005","ShOkato":"45379000","ShPoluchName":"УФК по г. Москве (УГИБДД ГУ МВД России по г.Москве)","Sum":3000,"Uin":"18810177180125209293"}', 'Sts': '7741525886', 'Type': 0, 'UID': 'f9e58750-5f64-4138-942a-67e0967d4547', 'VidNak': '2', 'VstupDate': '', 'Vu': ''}

In [148]:
fines_prepared_data = [
    {
        'Name': data['ApnDetail'][0]['Value'].replace('\t', ' - '),
        'Place': data['ApnDetail'][3]['Value'],
        'FineSum': data['FineSum'],
        
    }
    for data in fines_values
]

fines_prepared_data[0]

{'Name': '12.17 ч.1.2 - Движение или остановка на полосе для маршрутных ТС в Москве или в Санкт-Петербурге',
 'Place': 'МОСКВА Г.   МОХОВАЯ д.15/1',
 'FineSum': 3000}

In [149]:
df = fines_df = pd.DataFrame(fines_prepared_data)
df

,Name,Place,FineSum
0,12.17 ч.1.2 - Движение или остановка на полосе...,МОСКВА Г. МОХОВАЯ д.15/1,3000
1,12.09.2 - Превышение скорости движения ТС от 2...,"А/Д М-9 ""БАЛТИЯ"", 24КМ+750М, ИЗ МОСКВЫ",500
2,12.9.6 - Повторное превышение скорости на 40-6...,МОСКВА Г. РУБЛЕВСКОЕ Ш. д.79,2000
3,12.15.1 - Наруш.правил расп.т/с на пр.части бе...,МОСКВА Г. КУТУЗОВСКИЙ ПРОСП.,1500
4,12.9.6 - Повторное превышение скорости на 40-6...,МОСКВА Г. НОВЫЙ АРБАТ д.36/9,2000
...,...,...,...
830,12.09.2 - Превышение скорости движения ТС от 2...,МОСКВА Г. НОВЫЙ АРБАТ д.28,500
831,"12.16.5 Нарушение, предусмотренное частью 4 на...","г. Москва, Тверская улица, 4",3000
832,"12.16.5 Нарушение, предусмотренное частью 4 на...","г. Москва, Тверская улица, 4",3000
833,"12.16.5 Нарушение, предусмотренное частью 4 на...","г. Москва, ул. Охотный Ряд, д. 2",3000
834,"12.16.5 Нарушение, предусмотренное частью 4 на...","г. Москва, Тверская улица, 3",3000

In [150]:
summary = df.groupby('Name')['FineSum'].agg(['count', 'sum'])
summary

                                                    count     sum
Name
12.09.2 - Превышение скорости движения ТС от 20...    361  180500
12.09.3 - Превышение скорости движения ТС от 40...      7    7000
12.15.1 - Наруш.правил расп.т/с на пр.части без...     95  142500
12.15.5 - Повторный выезд на сторону, предназна...     21  105000
12.16.1 - Несоблюдение требований знаков или ра...      8    4000
12.16.2 - Поворот налево или разворот в нарушен...      1    1000
12.16.5 Нарушение, предусмотренное частью 4 нас...     15   45000
12.17 ч.1.2 - Движение или остановка на полосе ...    212  636000
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...      3    9000
12.9.6 - Повторное превышение скорости на 40-60...     94  188000
12.9.7 - Повторное превышение скорости на 60-80...     17   85000
8.14.2  - Неуплата за размещение транспортного ...      1    2500

In [151]:
summary = summary.sort_values(['count'], ascending=False)
summary

                                                    count     sum
Name
12.09.2 - Превышение скорости движения ТС от 20...    361  180500
12.17 ч.1.2 - Движение или остановка на полосе ...    212  636000
12.15.1 - Наруш.правил расп.т/с на пр.части без...     95  142500
12.9.6 - Повторное превышение скорости на 40-60...     94  188000
12.15.5 - Повторный выезд на сторону, предназна...     21  105000
12.9.7 - Повторное превышение скорости на 60-80...     17   85000
12.16.5 Нарушение, предусмотренное частью 4 нас...     15   45000
12.16.1 - Несоблюдение требований знаков или ра...      8    4000
12.09.3 - Превышение скорости движения ТС от 40...      7    7000
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...      3    9000
12.16.2 - Поворот налево или разворот в нарушен...      1    1000
8.14.2  - Неуплата за размещение транспортного ...      1    2500

In [152]:
summary.sum()

count        835
sum      1405500
dtype: int64

In [153]:
total = pd.Series(
    summary.sum(),
    name='Full summary',
)

In [154]:
total

count        835
sum      1405500
Name: Full summary, dtype: int64

In [155]:
summary.append(total)
summary

/var/folders/r0/f247yh3j4djfkghshd5yf41m0000gn/T/ipykernel_91264/2212474553.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  summary.append(total)

                                                    count     sum
Name
12.09.2 - Превышение скорости движения ТС от 20...    361  180500
12.17 ч.1.2 - Движение или остановка на полосе ...    212  636000
12.15.1 - Наруш.правил расп.т/с на пр.части без...     95  142500
12.9.6 - Повторное превышение скорости на 40-60...     94  188000
12.15.5 - Повторный выезд на сторону, предназна...     21  105000
12.9.7 - Повторное превышение скорости на 60-80...     17   85000
12.16.5 Нарушение, предусмотренное частью 4 нас...     15   45000
12.16.1 - Несоблюдение требований знаков или ра...      8    4000
12.09.3 - Превышение скорости движения ТС от 40...      7    7000
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...      3    9000
12.16.2 - Поворот налево или разворот в нарушен...      1    1000
8.14.2  - Неуплата за размещение транспортного ...      1    2500

In [156]:
pd.concat([summary, total])

                                                    count       sum          0
12.09.2 - Превышение скорости движения ТС от 20...  361.0  180500.0        NaN
12.17 ч.1.2 - Движение или остановка на полосе ...  212.0  636000.0        NaN
12.15.1 - Наруш.правил расп.т/с на пр.части без...   95.0  142500.0        NaN
12.9.6 - Повторное превышение скорости на 40-60...   94.0  188000.0        NaN
12.15.5 - Повторный выезд на сторону, предназна...   21.0  105000.0        NaN
12.9.7 - Повторное превышение скорости на 60-80...   17.0   85000.0        NaN
12.16.5 Нарушение, предусмотренное частью 4 нас...   15.0   45000.0        NaN
12.16.1 - Несоблюдение требований знаков или ра...    8.0    4000.0        NaN
12.09.3 - Превышение скорости движения ТС от 40...    7.0    7000.0        NaN
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...    3.0    9000.0        NaN
12.16.2 - Поворот налево или разворот в нарушен...    1.0    1000.0        NaN
8.14.2  - Неуплата за размещение транспортного ...    1.0    2500.0        NaN
count                                                 NaN       NaN      835.0
sum                                                   NaN       NaN  1405500.0

In [157]:
pd.concat([summary, total], join='outer')

                                                    count       sum          0
12.09.2 - Превышение скорости движения ТС от 20...  361.0  180500.0        NaN
12.17 ч.1.2 - Движение или остановка на полосе ...  212.0  636000.0        NaN
12.15.1 - Наруш.правил расп.т/с на пр.части без...   95.0  142500.0        NaN
12.9.6 - Повторное превышение скорости на 40-60...   94.0  188000.0        NaN
12.15.5 - Повторный выезд на сторону, предназна...   21.0  105000.0        NaN
12.9.7 - Повторное превышение скорости на 60-80...   17.0   85000.0        NaN
12.16.5 Нарушение, предусмотренное частью 4 нас...   15.0   45000.0        NaN
12.16.1 - Несоблюдение требований знаков или ра...    8.0    4000.0        NaN
12.09.3 - Превышение скорости движения ТС от 40...    7.0    7000.0        NaN
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...    3.0    9000.0        NaN
12.16.2 - Поворот налево или разворот в нарушен...    1.0    1000.0        NaN
8.14.2  - Неуплата за размещение транспортного ...    1.0    2500.0        NaN
count                                                 NaN       NaN      835.0
sum                                                   NaN       NaN  1405500.0

In [158]:
summary

                                                    count     sum
Name
12.09.2 - Превышение скорости движения ТС от 20...    361  180500
12.17 ч.1.2 - Движение или остановка на полосе ...    212  636000
12.15.1 - Наруш.правил расп.т/с на пр.части без...     95  142500
12.9.6 - Повторное превышение скорости на 40-60...     94  188000
12.15.5 - Повторный выезд на сторону, предназна...     21  105000
12.9.7 - Повторное превышение скорости на 60-80...     17   85000
12.16.5 Нарушение, предусмотренное частью 4 нас...     15   45000
12.16.1 - Несоблюдение требований знаков или ра...      8    4000
12.09.3 - Превышение скорости движения ТС от 40...      7    7000
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...      3    9000
12.16.2 - Поворот налево или разворот в нарушен...      1    1000
8.14.2  - Неуплата за размещение транспортного ...      1    2500

In [159]:
pd.concat([summary, total], names=['count', 'sum'])

                                                    count       sum          0
12.09.2 - Превышение скорости движения ТС от 20...  361.0  180500.0        NaN
12.17 ч.1.2 - Движение или остановка на полосе ...  212.0  636000.0        NaN
12.15.1 - Наруш.правил расп.т/с на пр.части без...   95.0  142500.0        NaN
12.9.6 - Повторное превышение скорости на 40-60...   94.0  188000.0        NaN
12.15.5 - Повторный выезд на сторону, предназна...   21.0  105000.0        NaN
12.9.7 - Повторное превышение скорости на 60-80...   17.0   85000.0        NaN
12.16.5 Нарушение, предусмотренное частью 4 нас...   15.0   45000.0        NaN
12.16.1 - Несоблюдение требований знаков или ра...    8.0    4000.0        NaN
12.09.3 - Превышение скорости движения ТС от 40...    7.0    7000.0        NaN
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...    3.0    9000.0        NaN
12.16.2 - Поворот налево или разворот в нарушен...    1.0    1000.0        NaN
8.14.2  - Неуплата за размещение транспортного ...    1.0    2500.0        NaN
count                                                 NaN       NaN      835.0
sum                                                   NaN       NaN  1405500.0

In [160]:
pd.concat([summary, total], keys=['sum', 'count'])

                                                          count       sum  \
sum   12.09.2 - Превышение скорости движения ТС от 20...  361.0  180500.0
      12.17 ч.1.2 - Движение или остановка на полосе ...  212.0  636000.0
      12.15.1 - Наруш.правил расп.т/с на пр.части без...   95.0  142500.0
      12.9.6 - Повторное превышение скорости на 40-60...   94.0  188000.0
      12.15.5 - Повторный выезд на сторону, предназна...   21.0  105000.0
      12.9.7 - Повторное превышение скорости на 60-80...   17.0   85000.0
      12.16.5 Нарушение, предусмотренное частью 4 нас...   15.0   45000.0
      12.16.1 - Несоблюдение требований знаков или ра...    8.0    4000.0
      12.09.3 - Превышение скорости движения ТС от 40...    7.0    7000.0
      12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...    3.0    9000.0
      12.16.2 - Поворот налево или разворот в нарушен...    1.0    1000.0
      8.14.2  - Неуплата за размещение транспортного ...    1.0    2500.0
count count                                                 NaN       NaN
      sum                                                   NaN       NaN

                                                                  0
sum   12.09.2 - Превышение скорости движения ТС от 20...        NaN
      12.17 ч.1.2 - Движение или остановка на полосе ...        NaN
      12.15.1 - Наруш.правил расп.т/с на пр.части без...        NaN
      12.9.6 - Повторное превышение скорости на 40-60...        NaN
      12.15.5 - Повторный выезд на сторону, предназна...        NaN
      12.9.7 - Повторное превышение скорости на 60-80...        NaN
      12.16.5 Нарушение, предусмотренное частью 4 нас...        NaN
      12.16.1 - Несоблюдение требований знаков или ра...        NaN
      12.09.3 - Превышение скорости движения ТС от 40...        NaN
      12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...        NaN
      12.16.2 - Поворот налево или разворот в нарушен...        NaN
      8.14.2  - Неуплата за размещение транспортного ...        NaN
count count                                                   835.0
      sum                                                 1405500.0

In [161]:
total

count        835
sum      1405500
Name: Full summary, dtype: int64

In [162]:
total.to_frame()

       Full summary
count           835
sum         1405500

In [163]:
total.to_frame().T

              count      sum
Full summary    835  1405500

In [164]:
pd.concat([summary, total.to_frame().T])

                                                    count      sum
12.09.2 - Превышение скорости движения ТС от 20...    361   180500
12.17 ч.1.2 - Движение или остановка на полосе ...    212   636000
12.15.1 - Наруш.правил расп.т/с на пр.части без...     95   142500
12.9.6 - Повторное превышение скорости на 40-60...     94   188000
12.15.5 - Повторный выезд на сторону, предназна...     21   105000
12.9.7 - Повторное превышение скорости на 60-80...     17    85000
12.16.5 Нарушение, предусмотренное частью 4 нас...     15    45000
12.16.1 - Несоблюдение требований знаков или ра...      8     4000
12.09.3 - Превышение скорости движения ТС от 40...      7     7000
12.19 ч.6 - Стоянка, остановка ТС на проезжей ч...      3     9000
12.16.2 - Поворот налево или разворот в нарушен...      1     1000
8.14.2  - Неуплата за размещение транспортного ...      1     2500
Full summary                                          835  1405500